test/performance/benchmarks/func-invocation-ego/run/single-fun-enclave-rsa-sacmat/1500.log
2025/10/20 03:46:03 Function mode: SINGLE
2025/10/20 03:46:03 RSA_SK is set, using it for encryption
{"level":"info","ts":1760931963.6659374,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/10/20 03:46:03 Starting func invocation probe for target: appender-ego
2025/10/20 03:46:03 Using rate: 1500
Requests      [total, rate, throughput]         449995, 1500.00, 1499.91
Duration      [total, attack, wait]             5m0s, 5m0s, 17.666ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.909ms, 19.652ms, 14.542ms, 30.204ms, 57.131ms, 98.744ms, 777.578ms
Bytes In      [total, mean]                     197097810, 438.00
Bytes Out     [total, mean]                     190347885, 423.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:449995  
Error Set:
2025/10/20 03:52:03 Shutting down InfluxReporter
2025/10/20 03:52:03 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 57.13093ms